import React from 'react'
import styles from './Identity.module.css'
import Image from 'next/image'
import AnimatedCard from '../animation/AnimatedCard'

const Identity = () => {
    const identityArrey=[
        {id:0,title:'ماموریت ما',src:'Selfi_Final.jpg',article:'با بهره گیری از فناوری، برای مشتریانمان تجربه خوشایند خرید و برای فروشندگان مارکت پلیس، تجربه خوب فروش ایجاد می‌کنیم. می‌خواهیم به کسب‌وکارهای ایرانی کمک کنیم تا با قدرت تکنولوژی کالاهای خود را بیشتر و بهتر به فروش برسانند. کمک به گذار از اقتصاد سنتی به اقتصاد دیجیتال، همسو با روندهای جهانی، مأموریت ما برای گسترش بازاری به وسعت ایران و منطقه خاورمیانه برای همه فروشندگان است. بدون شک این رسالت با رشد شایستگی های حرفه‌ای همکاران دیجی‌کالا امکان پذیر است.'},
        {id:1,title:'چشم‌انداز ما',src:'ourHope.jpg',article:' تبدیل شدن به برترین پلتفرم تجارت الکترونیک در خاورمیانه، دورنمای ما برای گام برداشتن در مسیر پر چالش خرید و فروش آنلاین است. برای رسیدن به این تصویر تمام توان خود را برای قدم گذاشتن در مسیرهای جدید به کار می‌گیریم.'},
        {id:2,title:'هویت ما با لبخند شما',src:'your-smile.jpg',article:'هویتمان را با لبخند تعریف کرده‌ایم. پس از تغییر هویت بصری دیجی‌کالا در ابتدای سال ۹۹ تمامی پیام‌های دیجی‌کالا را همراه با طرح لبخندی به نشانه تلاش برای ثبت تجربه‌ای خوشایند از خرید و فروش طراحی و به دست مخاطبان می‌رسانیم. هویت بصری جدید ما را در رنگ‌ها، لوگوها، تایپوگرافی‌ها و الگوها دنبال کنید. '}
    ]
  return (
    <div className={`${styles.container}`}>
        <div className={`${styles.header}`}>
            <div className={`${styles.headerImage}`}>
                <Image alt='red smile' width={200} height={60} src={'/images/whiteSmile.png'}/>
            </div>
            <div className={`${styles.headerArticle}`}>
                <span className={`${styles.headerTitle}`}>داستان یک لبخند</span>
                <span className={`${styles.article}`}>
                رویای ما لبخند است؛ لبخندی برای همه ایران. ایجاد تجربه خوشایند خرید و فروش برای همه مخاطبان دیجی‌کالا از کاربران و مشتریان گرفته تا اهالی رسانه و فروشندگان، باور و مسئولیتی‌ست که از ابتدای آغاز به کار دیجی‌کالا مبنای تمام فعالیت‌ها و پیشرفت‌ها شد. حالا پس از گذشت ۱۵ سال از فعالیت دیجی‌کالا این باور به وظیفه‌ای شیرین تبدیل شده است. ما اینجاییم تا با توسعه محصولات متنوع و افزودن سرویس‌های مختلف در گروه دیجی‌کالا با محوریت تکنولوژی‌های مبتنی بر تجارت الکترونیک، تجربه لبخند را برای همه مخاطبانمان محقق کنیم.
                </span>
            </div>
        </div>
        <div className={`${styles.content}`}>
            {identityArrey.map(item=>{
                return <AnimatedCard key={item.id} item={item} index={item.id}/>
            })}
        </div>
    </div>
  )
}

export default Identity